SparkEVO/SparkEVO-ArduinoCore-tinyAVR/megaavr/boards.txt
#----------------------------------------#
# TWI OPTIONS                            #
#________________________________________#
sparkevo_itronix_sensorboard.menu.wiremode.mors=Master or Slave (saves flash and RAM)
sparkevo_itronix_sensorboard.menu.wiremode.mors.build.wire=MORS

#----------------------------------------#
# printf() version options               #
#________________________________________#
sparkevo_itronix_sensorboard.menu.printf.default=Default (doesn't print floats, 1.4k flash use)

#----------------------------------------#
# PWM Pinning options                    #
#________________________________________#
sparkevo_itronix_sensorboard.menu.PWMmux.A_default=PB0-2, PA3-5, 1-series: PC0/1 (default)
sparkevo_itronix_sensorboard.menu.PWMmux.A_default.build.pwmflags=-DUSE_TIMERD0_PWM
sparkevo_itronix_sensorboard.menu.PWMmux.A_default.build.pwmabr=6A

#----------------------------------------#
# attachInterrupt Mode                   #
#________________________________________#
sparkevo_itronix_sensorboard.menu.attach.allenabled=On all pins, with new implementation.
sparkevo_itronix_sensorboard.menu.attach.allenabled.build.attachmode=-DCORE_ATTACH_ALL

#----------------------------------------#
# WDT MODE                               #
#________________________________________#
sparkevo_itronix_sensorboard.menu.WDTtimeout.disabled=Disabled (recommended)
sparkevo_itronix_sensorboard.menu.WDTwindow.disabled=No delay before window "opens"
sparkevo_itronix_sensorboard.menu.WDTtimeout.disabled.bootloader.wdttimeoutbits=0000
sparkevo_itronix_sensorboard.menu.WDTwindow.disabled.bootloader.wdtwindowbits=0000
